# Session

In [8]:
# install modules
pip install dill

Collecting dill
  Downloading dill-0.3.5.1-py2.py3-none-any.whl (95 kB)
Installing collected packages: dill
Successfully installed dill-0.3.5.1
Note: you may need to restart the kernel to use updated packages.

In [9]:
# import modules
import os
import pandas as pd
import numpy as np
import dill

In [39]:
# save session
dill.dump_session('notebook_env.db')

In [ ]:
# import session
dill.load_session('notebook_env.db')

In [5]:
##### Defining directory
os.chdir('C:\\Users\\Megaport\\20220814_projectDS')
os.chdir('C:\\Users\\Megaport\\Desktop\\jupyterNotebook')
os.getcwd()

'C:\\Users\\Megaport\\Desktop\\jupyterNotebook'

# Import

In [7]:
##### Import of tables into dataframes
dfLieux = pd.read_csv('20220817_table_lieux.csv', sep=',')
dfUsagers = pd.read_csv('20220814_table_usagers.csv', sep=',')
dfVehicules = pd.read_csv('20220817_table_vehicules.csv', sep=',')
dfCarac = pd.read_csv('20220817_table_caracteristiques.csv', sep=',')

##### Merging of tables into 1 pooled dataframe
# dfPool = pd.merge(dfLieux, dfUsagers, dfVehicules, dfCarac, on="Num_Acc")

C:\Users\Megaport\AppData\Local\Temp\ipykernel_9552\890290328.py:2: DtypeWarning: Columns (4,9,10,14,15) have mixed types. Specify dtype option on import or set low_memory=False.
  dfLieux = pd.read_csv('20220817_table_lieux.csv', sep=',')
C:\Users\Megaport\AppData\Local\Temp\ipykernel_9552\890290328.py:3: DtypeWarning: Columns (9,13) have mixed types. Specify dtype option on import or set low_memory=False.
  dfUsagers = pd.read_csv('20220814_table_usagers.csv', sep=',')
C:\Users\Megaport\AppData\Local\Temp\ipykernel_9552\890290328.py:4: DtypeWarning: Columns (11) have mixed types. Specify dtype option on import or set low_memory=False.
  dfVehicules = pd.read_csv('20220817_table_vehicules.csv', sep=',')
C:\Users\Megaport\AppData\Local\Temp\ipykernel_9552\890290328.py:5: DtypeWarning: Columns (6,12,14,15,16,17) have mixed types. Specify dtype option on import or set low_memory=False.
  dfCarac = pd.read_csv('20220817_table_caracteristiques.csv', sep=',')

In [11]:
print('dfLieux dimensions:', dfLieux.shape)
print('dfUsagers dimensions:', dfUsagers.shape)
print('dfVehicules dimensions:', dfVehicules.shape)
print('dfCarac dimensions:', dfCarac.shape)
# print('dfPool dimensions:', dfPool.shape)

dfLieux dimensions: (1065053, 22)
dfUsagers dimensions: (2380467, 17)
dfVehicules dimensions: (1817587, 14)
dfCarac dimensions: (1065053, 19)

# Data-management

# Descriptive statistics
### Mapping of variables
In this section, we describe each table

In [12]:
dfCarac.head(3)

,Unnamed: 0.1,Unnamed: 0,Num_Acc,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep,grav
0,0,0,201600000001,16,2,1,1445,1,2,1,8.0,3.0,5.0,"46, rue Sonneville",M,0.0,0.0,590,3
1,1,1,201600000002,16,3,16,1800,1,2,6,1.0,6.0,5.0,1a rue du cimetière,M,0.0,0.0,590,3
2,2,2,201600000003,16,7,13,1900,1,1,1,1.0,6.0,11.0,NaN,M,0.0,0.0,590,3

In [44]:
print('Jours:', len(dfCarac.jour.value_counts()))
print('Mois:', len(dfCarac.mois.value_counts()))
print('An:', len(dfCarac.an.value_counts()))
print('hrmn:', len(dfCarac.hrmn.value_counts()))
print('lum:', len(dfCarac.lum.value_counts()))
print('atm:', len(dfCarac.atm.value_counts()))
print('col:', len(dfCarac.col.value_counts()))
print(dfCarac.an.value_counts())
print(dfCarac.lum.value_counts())
print(dfCarac.atm.value_counts())
print(dfCarac.col.value_counts())

Jours: 31
Mois: 12
An: 16
hrmn: 3721
lum: 6
atm: 10
col: 8
5       87026
7       83850
6       82993
8       76767
9       74409
10      69379
11      66974
12      62250
17      60701
14      59854
16      59432
2019    58840
15      58654
13      58397
18      57783
2020    47744
Name: an, dtype: int64
 1    727047
 5    177299
 3     87688
 2     64056
 4      8958
-1         5
Name: lum, dtype: int64
 1.0    859398
 2.0    112118
 8.0     35361
 3.0     23140
 7.0     11683
 9.0      7470
 5.0      6997
 4.0      6108
 6.0      2692
-1.0        13
Name: atm, dtype: int64
 6.0    349947
 3.0    307035
 2.0    125194
 7.0    109515
 1.0    103866
 5.0     34109
 4.0     33851
-1.0      1517
Name: col, dtype: int64

In [37]:
dfCarac.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1065053 entries, 0 to 1065052
Data columns (total 19 columns):
 #   Column        Non-Null Count    Dtype
---  ------        --------------    -----
 0   Unnamed: 0.1  1065053 non-null  int64
 1   Unnamed: 0    1065053 non-null  int64
 2   Num_Acc       1065053 non-null  int64
 3   an            1065053 non-null  int64
 4   mois          1065053 non-null  int64
 5   jour          1065053 non-null  int64
 6   hrmn          1065053 non-null  object
 7   lum           1065053 non-null  int64
 8   agg           1065053 non-null  int64
 9   int           1065053 non-null  int64
 10  atm           1064980 non-null  float64
 11  col           1065034 non-null  float64
 12  com           1065051 non-null  object
 13  adr           922350 non-null   object
 14  gps           480052 non-null   object
 15  lat           577985 non-null   object
 16  long          577981 non-null   object
 17  dep           1065053 non-null  object
 18  grav          1065053 non-null  int64
dtypes: float64(2), int64(10), object(7)
memory usage: 154.4+ MB

In [13]:
dfLieux.head(3)

,Unnamed: 0.1,Unnamed: 0,Num_Acc,catr,voie,v1,v2,circ,nbv,pr,...,prof,plan,lartpc,larrout,surf,infra,situ,env1,vma,grav
0,0,0,201600000001,3.0,39,NaN,NaN,2.0,0.0,NaN,...,1.0,3.0,0.0,0.0,1.0,0.0,1.0,0.0,NaN,3
1,1,1,201600000002,3.0,39,NaN,NaN,1.0,0.0,NaN,...,1.0,2.0,0.0,58.0,1.0,0.0,1.0,0.0,NaN,3
2,2,2,201600000003,3.0,1,NaN,NaN,2.0,2.0,NaN,...,1.0,3.0,0.0,68.0,2.0,0.0,3.0,99.0,NaN,3

In [38]:
dfLieux.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1065053 entries, 0 to 1065052
Data columns (total 22 columns):
 #   Column        Non-Null Count    Dtype
---  ------        --------------    -----
 0   Unnamed: 0.1  1065053 non-null  int64
 1   Unnamed: 0    1065053 non-null  int64
 2   Num_Acc       1065053 non-null  int64
 3   catr          1065052 non-null  float64
 4   voie          960441 non-null   object
 5   v1            429229 non-null   float64
 6   v2            46379 non-null    object
 7   circ          1063479 non-null  float64
 8   nbv           1062322 non-null  float64
 9   pr            589569 non-null   object
 10  pr1           587750 non-null   object
 11  vosp          1062292 non-null  float64
 12  prof          1063104 non-null  float64
 13  plan          1062772 non-null  float64
 14  lartpc        902631 non-null   object
 15  larrout       952212 non-null   object
 16  surf          1063129 non-null  float64
 17  infra         1059645 non-null  float64
 18  situ          1060083 non-null  float64
 19  env1          953029 non-null   float64
 20  vma           106584 non-null   float64
 21  grav          1065053 non-null  int64
dtypes: float64(12), int64(4), object(6)
memory usage: 178.8+ MB

In [14]:
dfUsagers.head(3)

,Unnamed: 0,Num_Acc,place,catu,grav,sexe,trajet,secu,locp,actp,etatp,an_nais,num_veh,id_vehicule,secu1,secu2,secu3
0,0,201600000001,1.0,1,1,2,0.0,11.0,0.0,0.0,0.0,1983.0,B02,NaN,NaN,NaN,NaN
1,1,201600000001,1.0,1,3,1,9.0,21.0,0.0,0.0,0.0,2001.0,A01,NaN,NaN,NaN,NaN
2,2,201600000002,1.0,1,3,1,5.0,11.0,0.0,0.0,0.0,1960.0,A01,NaN,NaN,NaN,NaN

In [28]:
dfVehicules.head(3)

,Unnamed: 0.1,Unnamed: 0,Num_Acc,senc,catv,occutc,obs,obsm,choc,manv,num_veh,id_vehicule,motor,grav
0,0,0,201600000001,0.0,7,0.0,0.0,0.0,1.0,1.0,B02,NaN,NaN,3
1,1,1,201600000001,0.0,2,0.0,0.0,0.0,7.0,15.0,A01,NaN,NaN,3
2,2,2,201600000002,0.0,7,0.0,6.0,0.0,1.0,1.0,A01,NaN,NaN,3

### Graphs